var qvaliticars = (function () {
        var cars = new Array();
        cars.push({
            namecar: 'KOENIGSEGG CCXR'
            , specification: [
        2, //Кількість дверей
        2, //Кількість місць
        4719, //Обєм двигуна, куб.см.
        8, //Кількість целіндрів
        16, //Клапанів на целіндр
        2.9, //Розгін від 0 до 100 км/год., с.
        402, //Максимальна швидкість, км/год.
        4293, //Довжина, мм.
        1996, //Ширина, мм.
        1280, //Повна маса, кг.
         0]
        });
        cars.push({
            namecar: 'BUGATTI VEYRON 16.4 GRAND SPORT'
            , specification: [
        2, //Кількість дверей
        2, //Кількість місць
        7993, //Обєм двигуна, куб.см.
        16, //Кількість целіндрів
        4, //Клапанів на целіндр
        2.6, //Розгін від 0 до 100 км/год., с.
        375, //Максимальна швидкість, км/год.
        4462, //Довжина, мм.
        1998, //Ширина, мм.
        1888, //Повна маса, кг.
         0]
        });
        cars.push({
            namecar: 'PAGANI ZONDA CINQUE ROADSTER'
            , specification: [
        2, //Кількість дверей
        2, //Кількість місць
        7300, //Обєм двигуна, куб.см.
        12, //Кількість целіндрів
        8, //Клапанів на целіндр
        3.4, //Розгін від 0 до 100 км/год., с.
        350, //Максимальна швидкість, км/год.
        4293, //Довжина, мм.
        1996, //Ширина, мм.
        1210, //Повна маса, кг.
         0]
        });
        cars.push({
            namecar: 'LAMBORGHINI REVENTÓN'
            , specification: [
        2, //Кількість дверей
        2, //Кількість місць
        6496, //Обєм двигуна, куб.см.
        12, //Кількість целіндрів
        4, //Клапанів на целіндр
        3.3, //Розгін від 0 до 100 км/год., с.
        340, //Максимальна швидкість, км/год.
        4700, //Довжина, мм.
        2058, //Ширина, мм.
        1450, //Повна маса, кг.
         0]
        });
        cars.push({
            namecar: 'MAYBACH LANDAULET'
            , specification: [
        4, //Кількість дверей
        4, //Кількість місць
        5980, //Обєм двигуна, куб.см.
        12, //Кількість целіндрів
        3, //Клапанів на целіндр
        5.2, //Розгін від 0 до 100 км/год., с.
        250, //Максимальна швидкість, км/год.
        4293, //Довжина, мм.
        1996, //Ширина, мм.
        2180, //Повна маса, кг.
         0]
        });
        cars.push({
            namecar: 'SSC ULTIMATE AERO'
            , specification: [
        2, //Кількість дверей
        2, //Кількість місць
        6345, //Обєм двигуна, куб.см.
        8, //Кількість целіндрів
        16, //Клапанів на целіндр
        2.78, //Розгін від 0 до 100 км/год., с.
        436, //Максимальна швидкість, км/год.
        4475, //Довжина, мм.
        2101, //Ширина, мм.
        1125, //Повна маса, кг.
         0]
        });
    return {
        cars: cars
    };
})();